Autodesk.Revit.DB.DWGImportOptions.SetLineWeights(System.Collections.Generic.IList{System.Int32})
Set array of line weights.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DWGImportOptions.#ctor(Autodesk.Revit.DB.DWGImportOptions)
Constructs a new instance of DWGImportOptions as a copy of the import options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013